---
kind: method
id: M:Autodesk.Revit.DB.TriangulatedShellComponent.GetVertices
source: html/0c151904-c915-7eda-9939-9e16dbf42133.htm
---
# Autodesk.Revit.DB.TriangulatedShellComponent.GetVertices Method

Returns the vertices of the triangulation.

## Syntax (C#)
```csharp
public IList<XYZ> GetVertices()
```

## Returns
The vertices of the triangulation.